stevennolte/Module_Firmware/ESP32_Product_Controller/src/main.cpp
// Function to handle toggle switch commands
void handleToggleCommand(const String& command, const String& action) {
  if (command == "foldOuterWings") {
      foldOuterWingsState = (action == "on");
      Serial.printf("Fold Outer Wings: %s\n", foldOuterWingsState ? "ON" : "OFF");
      // Add your logic here to control hardware for "Fold Outer Wings"
    } else if (command == "sysEnable") {
      espConfig.rateData.systemState = (action == "on");
      Serial.printf("System Enable: %s\n", espConfig.rateData.systemState ? "ON" : "OFF");
      // Add your logic here to control hardware for "System Enable"
    } else if (command == "foldCenterWings") {
      foldCenterWingsState = (action == "on");
      Serial.printf("Fold Center Wings: %s\n", foldCenterWingsState ? "ON" : "OFF");
      // Add your logic here to control hardware for "Fold Center Wings"
  } else if (command == "raiseWings") {
      raiseWingsState = (action == "on");
      Serial.printf("Raise Wings: %s\n", raiseWingsState ? "ON" : "OFF");
      // Add your logic here to control hardware for "Raise Wings"
  } else {
      Serial.println("Unknown command received.");
  }
}

// Function to handle setting the application rate
void handleSetRegulatorPosition(AsyncWebServerRequest *request) {
  Serial.println("Received regulator target");
  if (request->hasParam("value")){
    String regPos = request->getParam("value")->value();
    if (espConfig.regData.regControl = 2){
      espConfig.regData.targetPosition = regPos.toFloat();
      canbus.sendRegCmd(espConfig.regData.targetPosition*100, espConfig.regData.speed);
    }
    
    
    Serial.printf("Received regPos: %f\n", espConfig.regData.targetPosition);
    
    request->send(200, "text/plain", "Regulator Position Set Successfully");
    
    
  }
   
}

// Function to handle setting the application rate
void handleSetApplicationRate(AsyncWebServerRequest *request) {
  Serial.println("Received set application rate request");
  if (request->hasParam("rate")){
    String rateStr = request->getParam("rate")->value();
    espConfig.rateData.targetRate = rateStr.toFloat();
    Serial.println(espConfig.updateRate());
    Serial.printf("Received rate: %f\n", espConfig.rateData.targetRate);
    if (espConfig.rateData.targetRate > 0) {
      // Add your logic here to set the application rate
      Serial.printf("Application rate set to: %f\n", espConfig.rateData.targetRate);
      request->send(200, "text/plain", "Application rate set successfully");
    } else {
      request->send(400, "text/plain", "Invalid rate value");
    }
    
  }
   
}
void handleGetApplicationRate(AsyncWebServerRequest *request) {
  // Create a JSON response with the current application rate
  StaticJsonDocument<100> doc;
  doc["rate"] = espConfig.rateData.targetRate; // Replace with your variable holding the application rate

  String jsonResponse;
  serializeJson(doc, jsonResponse);

  request->send(200, "application/json", jsonResponse);
}

void handleGetModuleState(AsyncWebServerRequest *request) {
    // Example variables for module state, target position, and current position
    int moduleState = 2; // Replace with your actual variable (1 = good, 2 = disconnected) TODO: Change to actual module state
    float targetPosition = 50.0; // Replace with your actual target position TODO: Change to actual target position
    float currentPosition = 48.5; // Replace with your actual current position TODO: Change to actual current position

    // Map the module state to a string
    String stateString = (moduleState == 1) ? "good" : "disconnected";

    // Create a JSON response
    StaticJsonDocument<200> doc;
    doc["state"] = stateString;
    doc["targetPosition"] = targetPosition;
    doc["currentPosition"] = currentPosition;
    doc["pressure"] = 0.0; // Replace with your actual pressure value TODO: Change to actual pressure value
    doc["flowRate"] = 0.0; // Replace with your actual flow rate value TODO: Change to actual flow rate value
    doc["level"] = 0.0; // Replace with your actual level value TODO: Change to actual level value

    // Serialize the JSON response
    String jsonResponse;
    serializeJson(doc, jsonResponse);

    // Send the JSON response
    request->send(200, "application/json", jsonResponse);
}

void handleGetPerformanceVariables(AsyncWebServerRequest *request) {
    Serial.println("Handling /performance/variables request...");

    // Example variables for performance data
    float pressureCurrent = 75.0; // Replace with your actual pressure current value
    float pressureTarget = 100.0; // Replace with your actual pressure target value
    float flowrateCurrent = 50.0; // Replace with your actual flowrate current value
    float flowrateTarget = 60.0; // Replace with your actual flowrate target value
    float levelCurrent = 30.0; // Replace with your actual level current value
    float levelTarget = 40.0; // Replace with your actual level target value

    // Create a JSON response
    StaticJsonDocument<256> doc; // Adjust size based on the number of variables
    doc["Pressure"]["current"] = pressureCurrent;
    doc["Pressure"]["target"] = pressureTarget;
    doc["Flowrate"]["current"] = flowrateCurrent;
    doc["Flowrate"]["target"] = flowrateTarget;
    doc["Level"]["current"] = levelCurrent;
    doc["Level"]["target"] = levelTarget;

    // Serialize the JSON response
    String jsonResponse;
    if (serializeJson(doc, jsonResponse) == 0) {
        Serial.println("Failed to serialize JSON");
        request->send(500, "application/json", "{\"error\":\"Failed to serialize JSON\"}");
        return;
    }

    Serial.println("JSON response:");
    Serial.println(jsonResponse);

    // Send the JSON response
    request->send(200, "application/json", jsonResponse);
}
#pragma endregion


bool I2Csetup(){
  if(!Wire.setPins(espConfig.gpioDefs.SDA_PIN, espConfig.gpioDefs.SCL_PIN)){
    Serial.println("Wire failed to set pins");
    return false;
  }
  // if(!twoWire.setClock(1000000)){
  //   Serial.println("Wire failed to set clock");
  //   return false;
  // }
  if(!Wire.begin()){
    Serial.println("Wire failed to begin");
    return false;
  }
  byte error, address;
  int nDevices;

  Serial.println("Scanning...");

 
