stevennolte/Module_Firmware/ESP32_Product_Controller/src/main.cpp
  Wire.beginTransmission(0x48);
  error = Wire.endTransmission();
  if (error == 0)
  {
    Serial.println("ADS1115 found at address 0x48  !");
    progData.adsState = 1;
  }
  else 
  {
    Serial.println("Unknown error at address 0x48");
    progData.adsState = 2;
  }
  if (progData.adsState == 2){
    return false;
  } else {
    return true;
  }
  
}

void setup() {
  progData.state = 0;
  myLED.startTask();
  progData.state = 2;
  espConfig.progData.canState = canbus.begin();
  // Start USB Serial Port
  Serial.begin(115200);
  delay(5000);   // Wait for the usb to connect so you can see the outputs at startup
  Serial.println("Starting up...");
  espConfig.progData.confRes = espConfig.loadConfig();
  // Start Wifi AP and Webserver for diagnostics
  // espConfig.wifiCfg.state = espWifi.makeAP();
  while (wifiCfg.state != 1){
    wifiCfg.state = espWifi.connect();
    if (millis()>120000){
      Serial.println("Failed to connect to wifi, starting AP");
      wifiCfg.state = espWifi.makeAP();
      break;
    }
  }
  Serial.println("Wifi State: " + String(espConfig.wifiCfg.state));
  #pragma region Server Setup
        // Serve the main HTML page
        #pragma region Page Handlers
        server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting Home file");
          request->send(LittleFS, "/product.html");
        });
        server.on("/product.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting Home file");
          request->send(LittleFS, "/product.html");
        });
        server.on("/settings.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting settings file");
          request->send(LittleFS, "/settings.html");
        });
        server.on("/debug.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting index file");
          request->send(LittleFS, "/debug.html");
        });
        server.on("/boom.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting boom file");
          request->send(LittleFS, "/boom.html");
        });
        server.on("/serverdata.html", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("getting serverdata file");
          request->send(LittleFS, "/serverdata.html");
        });
        #pragma endregion

        #pragma region Request Handlers
        server.on("/getDebugVars", HTTP_GET, handleDebugVars);
        server.on("/getFiles", HTTP_GET, handleFileList);
        server.on("/download", HTTP_GET, handleFileDownload);
        server.on("/reboot", HTTP_GET, handleReboot);
        
        #pragma endregion

        #pragma region Post Handlers
        server.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFileUpload);
        server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFirmwareUpload);
        server.on("/updatefs", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFilesystemUpload);

        
        server.on("/systemEnable/on", HTTP_POST, [](AsyncWebServerRequest *request) {
          espConfig.rateData.systemState = 1;
          Serial.println("System Enabled");
          request->send(200, "text/plain", "System enabled");
        });
        server.on("/systemEnable/off", HTTP_POST, [](AsyncWebServerRequest *request) {
          espConfig.rateData.systemState = 0;
          Serial.println("System Disabled");
          request->send(200, "text/plain", "System disabled");
        });
        server.on("/regulatorManualControl/on", HTTP_POST, [](AsyncWebServerRequest *request) {
          espConfig.regData.regControl = 2;
          Serial.println("regmanualctr on");
          request->send(200, "text/plain", "Regulator Manual Control Enabled");
        });
        server.on("/regulatorManualControl/off", HTTP_POST, [](AsyncWebServerRequest *request) {
          espConfig.regData.regControl = 1;
          Serial.println("regmanualctrl off");
          request->send(200, "text/plain", "Regulator Manual Control Disabled");
        });
        server.on("/threeSection/on", HTTP_POST, [](AsyncWebServerRequest *request) {
          espConfig.rateData.threeSection = 1;
          
          request->send(200, "text/plain", "Three Section Enabled");
        });
        server.on("/threeSection/off", HTTP_POST, [](AsyncWebServerRequest *request) {
          espConfig.rateData.threeSection = 0;
       
          request->send(200, "text/plain", "Three Section Disabled");
        });
        //-------------Server Template----------------
        // server.on("", HTTP_POST, [](AsyncWebServerRequest *request) {
          
        //   request->send(200, "text/plain", "");
        // });
        server.on("/momentary", HTTP_POST, handleMomentaryCommand);
        server.on("/setApplicationRate", HTTP_POST, handleSetApplicationRate);
        server.on("/getApplicationRate", HTTP_GET, handleGetApplicationRate);
        server.on("/module", HTTP_GET, handleGetModuleState);
        server.on("/performance", HTTP_GET, handleGetPerformanceVariables);
        server.on("/setRegulatorPosition", HTTP_POST, handleSetRegulatorPosition);
        // Endpoint to enable/disable a section
    server.on("^/section/(\\d+)/(enable|disable)$", HTTP_POST, [](AsyncWebServerRequest *request){
        int section = request->pathArg(0).toInt();
        String action = request->pathArg(1);

        if (section >= 1 && section <= 5) {
            espConfig.rateData.webserverSectionStates[section] = (action == "enable");
            request->send(200, "text/plain", String("Section ") + section + (action == "enable" ? " enabled" : " disabled"));
        } else {
            request->send(400, "text/plain", "Invalid section");
        }
    });

    // Endpoint to get the state of a section
    server.on("^/section/(\\d+)/state$", HTTP_GET, [](AsyncWebServerRequest *request){
        int section = request->pathArg(0).toInt();
        if (section >= 1 && section <= 5) {
            String json = String("{\"enabled\":") + (espConfig.rateData.webserverSectionStates[section] ? "true" : "false") + "}";
            request->send(200, "application/json", json);
        } else {
            request->send(400, "application/json", "{\"error\":\"Invalid section\"}");
        }
    });

        #pragma endregion
        
        server.addHandler(&events);
        
        // Start server
        server.begin();
      #pragma endregion
  temp_sensor_start();
  espUdp.begin();
  if (I2Csetup()){
    ads.begin();
  }
  Serial.println("654");
  productCtrl.begin();
  pinMode(espConfig.gpioDefs.FLOW_PIN, INPUT_PULLUP);
  attachInterrupt(espConfig.gpioDefs.FLOW_PIN, ISR, FALLING);
  
  
  progState = 1;
}

void debugPrint(){
  Serial.printf("Timestamp since boot [ms]: %lu", millis());
  Serial.printf(" progName: %s", espConfig.progCfg.name);
  Serial.printf(" progState: %lu", progState);
  Serial.printf(" confRes: %lu", espConfig.progData.confRes);
  Serial.printf(" wifiRes: %lu", espConfig.wifiCfg.state);
  float reading;
  temp_sensor_read_celsius(&reading);
  Serial.printf(" temp: %f", reading);
  Serial.println();
  // Serial.println(twoWire.requestFrom(0x22, 0x01));
  // Serial.printf("Mag x: %.2f mT, y: %.2f mT, z: %.2f mT, Temp: %.2f °C\n", espConfig.magData.x, espConfig.magData.y, espConfig.magData.z, (espConfig.magData.t*1.8)+32);
  // Serial.println();
  // Serial.println(espConfig.progCfg.name);
  // Serial.println();
}

void loop(){
  
  // please note that the value of status should be checked and properly handler
  sendServerData();
  if (millis()-progCfg.debugPrintTimestamp > progCfg.debugPrintDelay){
    progCfg.debugPrintTimestamp = millis();
    debugPrint();
  }
  delay(200);
  // debugPrint();
}


